import type {Metadata} from 'next';
import './globals.css';
import { Toaster } from "@/components/ui/toaster"
import { CartProvider } from '@/context/CartContext';
import { ClientOnly } from '@/components/layout/ClientOnly';

export const metadata: Metadata = {
  title: 'Doma',
  description: 'A complete E-commerce website using Firebase.',
  keywords: [
    'تسوق أونلاين', 'شراء منتجات', 'منتجات للبيع', 'عروض وخصومات', 'أفضل الأسعار', 'تسوق من الإنترنت', 'منتجات جديدة', 'هواتف ذكية', 'أكسسوارات الهواتف', 'ملابس رجالية', 'ملابس نسائية', 'ملابس أطفال', 'أحذية', 'حقائب', 'إكسسوارات', 'ساعات', 'أدوات تجميل', 'مستحضرات عناية شخصية', 'عطور', 'أجهزة كهربائية منزلية', 'تلفزيونات', 'ثلاجات', 'غسالات', 'مكيفات', 'أدوات مطبخ', 'خلاطات', 'محضرات قهوة', 'أواني طهي', 'أدوات منزلية', 'أدوات مكتبية', 'أدوات رياضية', 'معدات رياضية', 'لوازم مدرسية', 'ألعاب وهدايا', 'كتب ومجلات', 'كمبيوترات', 'لابتوبات', 'تابليت', 'سماعات', 'كاميرات', 'أجهزة صوتية', 'أجهزة كهربائية صغيرة', 'أدوات الحدائق', 'ديكورات منزلية', 'إضاءات', 'مفروشات', 'أغطية وسجاد', 'أدوات سفر', 'أدوات رحلات', 'منتجات تكنولوجية', 'شحن سريع', 'منتجات أصلية', 'منتجات عالية الجودة', 'منتجات رائجة', 'منتجات شعبية', 'عروض يومية', 'خصومات موسمية', 'منتجات محدودة', 'تسوق بسهولة', 'الدفع عند الاستلام', 'الدفع الإلكتروني', 'طرق دفع آمنة', 'هدايا', 'أدوات شخصية', 'أدوات مكتبية منزلية', 'مستلزمات رياضية', 'أجهزة لياقة', 'أجهزة ذكية', 'منتجات عصرية', 'منتجات فاخرة', 'منتجات اقتصادية', 'منتجات متنوعة', 'تسوق لكل الفئات', 'كل المنتجات', 'أي منتج', 'أفضل العروض', 'منتجات مميزة', 'منتجات حصرية', 'منتجات أصلية', 'منتجات حديثة', 'تسوق آمن', 'منتجات موثوقة', 'صفقات رائعة', 'تخفيضات اليوم', 'تسوق الآن', 'عروض محدودة', 'كل ما تبحث عنه', 'كل ما تحتاجه', 'منتجات للعائلة', 'منتجات للجميع', 'أجهزة منزلية', 'أجهزة ذكية', 'تكنولوجيا حديثة', 'ألعاب إلكترونية', 'ألعاب تعليمية', 'كتب تعليمية', 'لوازم الحفلات', 'هدايا عيد ميلاد', 'هدايا للأطفال', 'أدوات للرسم', 'أدوات للتلوين', 'منتجات للمطبخ', 'أدوات تنظيف', 'أدوات صيانة', 'أدوات كهربائية', 'إكسسوارات سيارات', 'أدوات ميكانيكا', 'أجهزة سلامة منزلية', 'كاميرات مراقبة', 'مستلزمات السفر', 'حقائب سفر', 'نظارات شمسية', 'معدات لياقة بدنية', 'منتجات حيوانات أليفة'
  ],
   icons: {
    icon: 'https://res.cloudinary.com/doqltxyb2/image/upload/v1759015201/D_hm7dda.png',
  },
};

export default function RootLayout({
  children,
}: Readonly<{
  children: React.ReactNode;
}>) {
  return (
    <html lang="ar" dir="rtl">
      <head>
        <link rel="preconnect" href="https://fonts.googleapis.com" />
        <link rel="preconnect" href="https://fonts.gstatic.com" crossOrigin="anonymous" />
        <link href="https://fonts.googleapis.com/css2?family=Inter:wght@400;500;600;700&display=swap" rel="stylesheet" />
      </head>
      <body>
          <CartProvider>
            <ClientOnly>
                {children}
                <Toaster />
            </ClientOnly>
          </CartProvider>
      </body>
    </html>
  );
}
